<?php
return [
 'title' => 'ورود',
 'heading' => 'به حساب خود وارد شوید',
 'buttons' => [
  'submit' => [
   'label' => 'ورود',
  ],
 ],
 'fields' => [
  'email' => [
   'label' => 'آدرس ایمیل',
  ],
  'password' => [
   'label' => 'کلمه عبور',
  ],
  'remember' => [
   'label' => 'مرا به خاطر بسپار',
  ],
 ],
 'messages' => [
  'failed' => "این اعتبارنامه ها با سوابق ما مطابقت ندارد.",
  'throttled' => 'تلاش برای ورود به سیستم بسیار زیاد است. لطفاً در :seconds ثانیه دوباره امتحان کنید.',
 ],
];
