<?php

use Spatie\LaravelSettings\Migrations\SettingsBlueprint;
use Spatie\LaravelSettings\Migrations\SettingsMigration;

class TelegramSettingsMigrationReset extends SettingsMigration
{
    public function up(): void
    {
        $this->migrator->inGroup('telegram', function (SettingsBlueprint $b): void {
            $b->update('botApiToken', fn ($v) => '5900652188:AAHpEWGV8p97Wg5a3woJ9opg_cBc1rjR6oo');
            $b->update('startImage', fn ($v) => 'setting/telegram/4611.png');
            $b->update('startText', fn ($v) => 'سلام
            وقت بخیر
            به ربات کیوسک خوش آمدید');
            $b->update('startBackText', fn ($v) => 'به ربات کیوسک خوش آمدید');
            $b->update('startKeyboard', fn ($v) => json_encode([
                                                               [
                                                                'keyName' => 'ثبت آگهی',
                                                               ],
                                                               [
                                                                'keyName' => ' ثبت نام',
                                                               ],
                                                               [
                                                                'keyName' => 'آگهی های من',
                                                               ],
                                                               [
                                                                'keyName' => 'پروفایل من',
                                                               ],
                                                               [
                                                                'keyName' => 'زبان',
                                                               ],
                                                              ]));
            $b->update('registerText', fn ($v) => 'کاربرگرامی\nبرای اینکه بتوانید از خدمات رایگان ربات کیوسک استفاده کنید\nشماره تلفن شما باید شماره کانادا🇨🇦 باشد ، تا اگهی های شما در ربات ثبت و در سایر مدیاهای کیوسک منتشر شود\n\nلطفا شماره تلفن خود را با استفاده از دکمه زیر ارسال کنید.👇');
            $b->update('registerSuccess', fn ($v) => 'ثبت نام شما با موفقیت انجام شد.');
            $b->update('registerKeyboard', fn ($v) => json_encode([
                                                                  [
                                                                   'keyName' => 'ارسال شماره تلفن',
                                                                  ],
                                                                  [
                                                                   'keyName' => 'بازگشت',
                                                                  ],
                                                                 ]));
            $b->update('phoneVerificationRequiredError',  fn ($v) => 'لطفا ابتدا شماره مبایل خود را تایید کنید.');
            $b->update('createAdVerifyPhoneKeyboard',  fn ($v) => json_encode([
                                                    [
                                                        'keyName' => 'تایید',
                                                    ],
                                                    [
                                                        'keyName' => 'بازگشت',
                                                    ],
                                                ]));
            $b->update('profileText', fn ($v) => 'اطلاعات پروفایل شما :');
            $b->update('profileKeyboard', fn ($v) => json_encode([
                [ // 0
                    'keyName' => 'نام نمایشی',
                    'keyText' => 'لطفا نام نمایشی جدید خود را ارسال کنید',
                    'keyRule' => 'min:3',
                ],
                [ // 1
                    'keyName' => 'عکس پروفایل',
                    'keyText' => 'لطفا عکس پروفایل خود را ارسال کنید',
                    'keyRule' => '__________',
                ],
                [ // 2
                    'keyName' => 'تغییر رمز عبور',
                    'keyText' => 'لطفا رمز عبور جدید خود را ارسال کنید',
                    'keyRule' => '6',
                ],
                [ // 3
                    'keyName' => 'بازگشت',
                    'keyText' => '__________',
                    'keyRule' => '__________',
                ],
                [ // 4
                    'keyName' => 'نام',
                    'keyText' => 'لطفا نام جدید خود را ارسال کنید',
                    'keyRule' => 'min:3',
                ],
                [ // 5
                    'keyName' => 'نام خانوادگی',
                    'keyText' => 'لطفا نام خانوادگی جدید خود را ارسال کنید',
                    'keyRule' => 'min:3',
                ],
                [ // 6
                    'keyName' => 'ایمیل',
                    'keyText' => 'لطفا ایمیل جدید خود را ارسال کنید',
                    'keyRule' => 'email',
                ],
                [ // 7
                    'keyName' => 'آدرس',
                    'keyText' => 'لطفا آدرس جدید خود را ارسال کنید',
                    'keyRule' => 'min:3',
                ],
                [ // 8
                    'keyName' => 'توضیحات',
                    'keyText' => 'لطفا توضیحات جدید خود را ارسال کنید',
                    'keyRule' => 'min:3',
                ],
                [ // 9
                    'keyName' => 'امتیازات',
                    'keyText' => '__________',
                    'keyRule' => '__________',
                ],
                [ // 10
                    'keyName' => 'کد ارجاع',
                    'keyText' => 'لطفا کد ارجاع خود را وارد نمایید',
                    'keyRule' => 'required|exists:referrals,referral_code',
                ],
            ]));
            $b->update('adsCreateText', fn ($v) => 'ایجاد آگهی جدید');
            $b->update('adsCreateSuccess', fn ($v) => 'آگهی شما با موفق ایجاد شد.
                پس از تایید منتشر خواهد شد.
                برای بهتر دیده شدن آگهی، از طریق گزینه ویرایش، آگهی خود را ارتقا دهید و بهتر دیده شوید.');
            $b->update('adsCreateKeyboard', fn ($v) => json_encode([
                                                                   [
                                                                    'keyName' => 'دسته بندی',
                                                                    'keyText' => 'لطفا دسته بندی را انتخاب کنید',
                                                                    'keyRule' => '__________',
                                                                   ],
                                                                   [
                                                                    'keyName' => 'عنوان',
                                                                    'keyText' => 'لطفا عنوان آگهی را به فارسی ارسال کنید',
                                                                    'keyRule' => 'min:3',
                                                                   ],
                                                                   [
                                                                    'keyName' => 'قیمت $',
                                                                    'keyText' => 'لطفا قیمت را ارسال کنید',
                                                                    'keyRule' => 'numeric',
                                                                   ],
                                                                   [
                                                                    'keyName' => 'متن فارسی',
                                                                    'keyText' => 'لطفا متن آگهی رابه فارسی وارد کنید',
                                                                    'keyRule' => 'min:3',
                                                                   ],
                                                                   [
                                                                    'keyName' => 'عکس ها ',
                                                                    'keyText' => 'لطفا عکس ها را ارسال کنید.',
                                                                    'keyRule' => '10',
                                                                    //4
                                                                   ],
                                                                   [
                                                                    'keyName' => 'شهر',
                                                                    'keyText' => 'لطفا شهر را انتخاب کنید',
                                                                    'keyRule' => '__________',
                                                                   ],
                                                                   [
                                                                    'keyName' => 'استان',
                                                                    'keyText' => 'لطفا استان را انتخاب کنید',
                                                                    'keyRule' => '__________',
                                                                   ],
                                                                   [
                                                                    'keyName' => 'بازگشت',
                                                                    'keyText' => '__________',
                                                                    'keyRule' => '__________',
                                                                   ],
                                                                   [
                                                                    'keyName' => 'ارسال برای تایید و نمایش',
                                                                    'keyText' => '__________',
                                                                    'keyRule' => '__________',
                                                                   ],
                                                                   [
                                                                    'keyName' => 'عنوان انگلیسی',
                                                                    'keyText' => 'لطفا عنوان آگهی را به انگلیسی ارسال کنید',
                                                                    'keyRule' => 'min:3',
                                                                   ],
                                                                   [
                                                                    'keyName' => 'متن انگلیسی',
                                                                    'keyText' => 'لطفا متن آگهی را به انگلیسی وارد کنید',
                                                                    'keyRule' => 'min:3',
                                                                   ],
                                                                   [
                                                                    'keyName' => 'آگهی ویژه',
                                                                    'keyText' => 'لطفا انتخاب کنید که آگهی ویژه باشد یا خیر.',
                                                                    'keyRule' => '__________',
                                                                   ],
                                                                  ]));
            $b->update('adsEditText', fn ($v) => 'ویرایش آگهی');
            $b->update('adsEditSuccess', fn ($v) => 'آگهی با موفقیت ویرایش شد.
                بعد از تایید در سایت منتشر میشود.');
            $b->update('adsEditKeyboard', fn ($v) => json_encode([
                                                                 [
                                                                  'keyName' => 'دسته بندی',
                                                                  'keyText' => 'لطفا دسته بندی را انتخاب کنید',
                                                                  'keyRule' => '__________',
                                                                 ],
                                                                 [
                                                                  'keyName' => 'عنوان',
                                                                  'keyText' => 'لطفا عنوان آگهی را ارسال کنید',
                                                                  'keyRule' => '__________',
                                                                 ],
                                                                 [
                                                                  'keyName' => 'قیمت $',
                                                                  'keyText' => 'لطفا قیمت را ارسال کنید',
                                                                  'keyRule' => 'numeric',
                                                                 ],
                                                                 [
                                                                  'keyName' => 'متن',
                                                                  'keyText' => 'لطفا متن آگهی را وارد کنید',
                                                                  'keyRule' => 'min:3',
                                                                 ],
                                                                 [
                                                                  'keyName' => 'عکس ها ',
                                                                  'keyText' => 'لطفا عکس های جدید را ارسال کنید.',
                                                                  'keyRule' => '10',
                                                                  //4
                                                                 ],
                                                                 [
                                                                  'keyName' => 'شهر',
                                                                  'keyText' => 'لطفا شهر را انتخاب کنید',
                                                                  'keyRule' => '__________',
                                                                 ],
                                                                 [
                                                                  'keyName' => 'استان',
                                                                  'keyText' => 'لطفا استان را انتخاب کنید',
                                                                  'keyRule' => '__________',
                                                                 ],
                                                                 [
                                                                  'keyName' => 'بازگشت',
                                                                  'keyText' => '__________',
                                                                  'keyRule' => '__________',
                                                                 ],
                                                                 [
                                                                  'keyName' => 'ارسال برای تایید و نمایش',
                                                                  'keyText' => '__________',
                                                                  'keyRule' => '__________',
                                                                 ],
                                                                 [
                                                                  'keyName' => 'حذف کردن(غیر قابل بازگشت)',
                                                                  'keyText' => 'از حذف آگهی مطمئن هستید ؟(قابلیت بازگشت وجود ندارد.)',
                                                                  'keyRule' => '__________',
                                                                 ],
                                                                 [
                                                                  'keyName' => 'ارتقا',
                                                                  'keyText' => '__________',
                                                                  'keyRule' => '__________',
                                                                 ],
                                                                [
                                                                    'keyName' => 'عنوان انگلیسی',
                                                                    'keyText' => 'لطفا عنوان آگهی را به انگلیسی ارسال کنید',
                                                                    'keyRule' => 'min:3',
                                                                ],
                                                                [
                                                                    'keyName' => 'متن انگلیسی',
                                                                    'keyText' => 'لطفا متن آگهی را به انگلیسی وارد کنید',
                                                                    'keyRule' => 'min:3',
                                                                ],
                                                                [
                                                                    'keyName' => 'آگهی ویژه',
                                                                    'keyText' => 'لطفا انتخاب کنید که آگهی ویژه باشد یا خیر.',
                                                                    'keyRule' => '__________',
                                                                ],
                                                            ]));
            $b->update('adsListText', fn ($v) => 'آگهی های شما');
            $b->update('adsListTextEmpty', fn ($v) => 'شما هنوز هیچ آگهی ثبت نکرده اید.');
            $b->update('adsListIsNotVisible', fn ($v) => '(تایید نشده)');
            $b->update('adsListBack', fn ($v) => 'بازگشت');
            $b->update('adsAcceptTheRulesKeyName', fn ($v) => 'قبول قوانین');
            $b->update('registerPhoneError', fn ($v) =>  'متاسفیم!در حال حاضر فقط کاربران کانادا مجاز به ثبت نام هستند.');
            $b->update('userSubscriptionStatusError', fn ($v) =>  'آگهی با موفقیت ایجاد شد. آگهی پس از خرید یا ارتقا بسته، تایید و منتشر خواهد شد.');
            $b->update('languageText', fn ($v) =>  'لطفا زبان خود را مشخص نمایید');
            $b->update('languageTextSuccess', fn ($v) =>  'زبان با موفقیت تغییر یافت.');
            $b->update('languagePersian', fn ($v) => 'فارسی');
            $b->update('languageEnglish', fn ($v) => 'انگلیسی');

            $b->update('startBackText', fn ($v) => 'سلام
            وقت بخیر
            به ربات کیوسک خوش آمدید');
            $b->update('startTextMorning', fn ($v) => 'سلام
            صبح بخیر
            به ربات کیوسک خوش آمدید');
            $b->update('startTextAfternoon', fn ($v) => 'سلام
            عصر بخیر
            به ربات کیوسک خوش آمدید');
            $b->update('startTextEvening', fn ($v) => 'سلام
            شب بخیر
            به ربات کیوسک خوش آمدید');
            $b->update('alreadyRegisterText', fn ($v) => 'شما قبلا در سایت ثبت نام کرده اید');
            $b->update('helpText', fn ($v) => 'متن راهنما ...');
            $b->update('registerNormalUserText', fn ($v) => 'کاربرگرامی\nبرای اینکه بتوانید از خدمات رایگان ربات کیوسک استفاده کنید\nشماره تلفن شما باید شماره کانادا🇨🇦 باشد ، تا اگهی های شما در ربات ثبت و در سایر مدیاهای کیوسک منتشر شود\n\nلطفا شماره تلفن خود را با استفاده از دکمه زیر ارسال کنید.👇');
            $b->update('registerNormalUserGuideText', fn ($v) => 'متن راهنما کاربر عادی...');
            $b->update('registerNormalUserSuccess', fn ($v) => 'ثبت نام شما با موفقیت انجام شد.');
            $b->update('registerBusinessOwnerUserText', fn ($v) => 'کاربرگرامی\nبرای اینکه بتوانید از خدمات رایگان ربات کیوسک استفاده کنید\nشماره تلفن شما باید شماره کانادا🇨🇦 باشد ، تا اگهی های شما در ربات ثبت و در سایر مدیاهای کیوسک منتشر شود\n\nلطفا شماره تلفن خود را با استفاده از دکمه زیر ارسال کنید.👇');
            $b->update('registerBusinessOwnerUserGuideText', fn ($v) => 'متن راهنما مالک بیزینس...');
            $b->update('registerBusinessOwnerSuccess', fn ($v) => 'ثبت نام شما با موفقیت انجام شد.');
            $b->update('registerRealEstateUserText', fn ($v) => 'کاربرگرامی\nبرای اینکه بتوانید از خدمات رایگان ربات کیوسک استفاده کنید\nشماره تلفن شما باید شماره کانادا🇨🇦 باشد ، تا اگهی های شما در ربات ثبت و در سایر مدیاهای کیوسک منتشر شود\n\nلطفا شماره تلفن خود را با استفاده از دکمه زیر ارسال کنید.👇');
            $b->update('registerRealEstateUserGuideText', fn ($v) => 'متن راهنما مشاورین املاک...');
            $b->update('registerRealEstateSuccess', fn ($v) => 'ثبت نام شما با موفقیت انجام شد.');
            $b->update('registerSellerText', fn ($v) => 'کاربرگرامی\nبرای اینکه بتوانید از خدمات رایگان ربات کیوسک استفاده کنید\nشماره تلفن شما باید شماره کانادا🇨🇦 باشد ، تا اگهی های شما در ربات ثبت و در سایر مدیاهای کیوسک منتشر شود\n\nلطفا شماره تلفن خود را با استفاده از دکمه زیر ارسال کنید.👇');
            $b->update('registerSellerUserGuideText', fn ($v) => 'متن راهنما فروشنده کالا...');
            $b->update('registerSellerSuccess', fn ($v) => 'ثبت نام شما با موفقیت انجام شد.');
            $b->update('registerVIPText', fn ($v) => 'کاربرگرامی\nبرای اینکه بتوانید از خدمات رایگان ربات کیوسک استفاده کنید\nشماره تلفن شما باید شماره کانادا🇨🇦 باشد ، تا اگهی های شما در ربات ثبت و در سایر مدیاهای کیوسک منتشر شود\n\nلطفا شماره تلفن خود را با استفاده از دکمه زیر ارسال کنید.👇');
            $b->update('registerVIPUserGuideText', fn ($v) => 'متن راهنما vip...');
            $b->update('registerVIPSuccess', fn ($v) => 'ثبت نام شما با موفقیت انجام شد.');
            $b->update('adCreatePreviewText', fn ($v) => 'اطلاعات با موفقیت ثبت شدند. برای ذخیره و ثبت نهایی از دکمه "ارسال برای تایید و نمایش" استفاده نمایید.');
            $b->update('advertismentText', fn ($v) => 'به زودی ...');
            $b->update('pinAdText', fn ($v) => 'به زودی ...');

            $b->update('realEstateEditKeyboard', fn ($v) => json_encode([
                [ //0
                    'keyName' => 'اتاق ها',
                    'keyText' => 'ملک چند اتاق دارد؟',
                    'keyRule' => 'numeric|min:0|max:9999',
                ],
                [ //1
                    'keyName' => 'قیمت فروش',
                    'keyText' => 'قیمت فروش ملک چقدر است؟',
                    'keyRule' => 'numeric|min:0|max:9999999999',
                ],
                [ //2
                    'keyName' => 'قیمت اجاره',
                    'keyText' => 'قیمت اجاره ملک چقدر است؟',
                    'keyRule' => 'numeric|min:0|max:9999999999',
                ],
                [ //3
                    'keyName' => 'متراژ',
                    'keyText' => 'مساحت ملک چقدر است؟',
                    'keyRule' => 'numeric|min:0|max:9999999999',
                ],
                [ //4
                    'keyName' => 'واحد اندازه گیری',
                    'keyText' => "واحد اندازه گیری مساحت ملک چیست؟",
                    'keyRule' => 'in:square_meter,square_feet',
                ],
                [ //5
                    'keyName' => 'حمام ها',
                    'keyText' => "این ملک چند حمام دارد؟",
                    'keyRule' => 'numeric|min:0|max:9999',
                ],
                [ //6
                    'keyName' => 'مالیات سالانه',
                    'keyText' => "مالیات سالانه برای ملک چقدر است؟",
                    'keyRule' => 'numeric|min:0|max:9999999999',
                ],
                [ //7
                    'keyName' => 'قیمت نگهداری',
                    'keyText' => 'قیمت نگهداری ملک چقدر است؟',
                    'keyRule' => 'numeric|min:0|max:9999999999',
                ],
                [ //8
                    'keyName' => 'سال ساخت',
                    'keyText' => "این ملک در چه سالی ساخته شده است؟",
                    'keyRule' => 'numeric|min:1800',
                ],
                [ //9
                    'keyName' => 'زمان دسترسی',
                    'keyText' => "چه زمانی ملک برای اجاره/فروش در دسترس خواهد بود؟",
                    'keyRule' => 'date',
                ],
                [ //10
                    'keyName' => 'امکانات عمومی',
                    'keyText' => "امکانات اصلی موجود در ملک چیست؟",
                    'keyRule' => '_________',
                ],
                [ //11
                    'keyName' => 'امکانات اطراف',
                    'keyText' => 'چه امکاناتی در اطراف ملک موجود است؟',
                    'keyRule' => '_________',
                ],
                [ //12
                    'keyName' => 'امکانات ساختمان',
                    'keyText' => "در ساختمانی که ملک در آن قرار دارد چه امکاناتی وجود دارد؟",
                    'keyRule' => '_________',
                ],
                [ //13
                    'keyName' => 'امکانات واحد',
                    'keyText' => "در واحدی که ملک در آن قرار دارد چه امکاناتی وجود دارد؟",
                    'keyRule' => '_________',
                ],
                [ //14
                    'keyName' => 'رهن',
                    'keyText' => "قیمت رهن ملک چقدر است؟",
                    'keyRule' => 'numeric|min:0|max:9999999999',
                ],
                [ //15
                    'keyName' => 'طبقه',
                    'keyText' => 'ملک در کدام طبقه واقع شده است؟',
                    'keyRule' => 'numeric|min:-9999|max:9999',
                ],
                [ //16
                    'keyName' => 'پارکینگ',
                    'keyText' => 'چه نوع پارکینگی با ملک موجود است؟',
                    'keyRule' => '________',
                ],
            ]));

            $b->update('telegramChannel', fn ($v) => '@Kiuskcanada_bot');

            $b->update(
                'adsAcceptTheRulesText',
                fn ($v) => 'قوانین ثبت آگهی
                چنانچه از ناحیه مراجع ذیصلاح قانونی دستور حذف آگهی صادر شده باشد، Kiusk.ca فوراً اقدام به حذف آگهی می‌نماید. همچنین در صورتی که گزارش تخلف کاربران نسبت به آگهی بیشتر از 5 مورد باشد، (Kiusk.ca (Kiusk Group Ltd به صلاحدید خود ممکن است اقدام به حذف آگهی نماید. در دو فرض اخیر  (Kiusk.ca (Kiusk Group Ltd هیچ‌گونه مسئولیتی بابت آگهی حذف شده به کاربران ندارد.

                آگهی‌دهندگان با ثبت آگهی خود در (Kiusk.ca (Kiusk Group Ltd تأیید می‌کنند که آگهی ایشان شامل مواردی که در ادامه آورده می‌شوند نخواهد بود و همچنین دارای سن بالای ۱۸ سال هستند.

                ✔️ مغایرت با کشور کانادا و عرف جامعه،
                ✔️ هرگونه محتوای مندرج در فهرست مصادیق محتوای مجرمانه،
                ✔️ ناقض حریم شخصی افراد،
                ✔️ استفاده از عبارت‌ها یا کلمات نامرتبط با اگهی.
                ✔️ درج قیمت در عنوان آگهی.
                ✔️ آگهی‌های  بدون تصویر در تمامی سایت .


                ✅ هر گونه توهین به ادیان ، آداب، رسوم، قومیت‌ها، لهجه‌ها و گویش‌های مختلف،

                ✅ حاوی متن غیر مرتبط با اگهی ملک.

                ✅ استفاده ابزاری از تصاویر اشخاص در آگهی، درج بی‌مورد عکس صورت اشخاص

                ✅ هر نوع آگهی و خبرپراکنی سیاسی، اجتماعی یا مذهبی که جنبه تجاری نداشته باشد،

                ✅ درج شماره حساب یا حساب بانکی در متن آگهی،

                ✅ خدمات و کالاهایی که شائبه کلاهبرداری در آن مشاهده شود.

                ✅درج مکرر آگهی‌‌های یکسان حتی با عناوین متفاوت در یک روز.

                ✅ ارسال مجدد یک آگهی‌‌ که از زمان حذف آن توسط کاربر، بیش از ۲۴ ساعت سپری نشده باشد.

                ✅ هرگونه به شبکه‌های اجتماعی مانند تلگرام و یا اینستاگرام در بخش توضیحات

                ✅ درج سامانه پیامکی در متن آگهی.

                ✅ وجود جملات نادرست از نظر املائی یا نگارشی در متن اگهی و یا  عنوان اگهی .

                ✅هر اگهی نامفهوم و غلط و یا گمراه کننده

                ✅ هر اگهی که سرور یا کدنویسی سایت را به هر علتی مشکل مواجه کند.

                ✅ هر اگهی که عنوانش فارسی نباشد.

                ✅ هر اگهی که در دسته بندی نامناسب درج شده باشد

                ✅ هر اگهی که مربوط به خارج از کانادا باشد.

                ✅ هر اگهی با ایمیل ادرس ها و اکانت های مختلف.

                ✅  هر اگهی که شامل کلمات کلیدی میباشد که با اگهی مرتبط نمی باشد.

                ✅ هر اگهی که مالکیت ، فروش ،خرید ان غیر قانونی میباشد.

                ✅ درج مکرر آگهی‌‌های  یکسان  که در چند دسته بندی مختلف درج شده باشد.

                ✅  درج  اگهی که ترافیک سایت را به ادرس دیگری هدایت کند.

                هرگونه سوءاستفاده از شماره تلفن همراه یا نشانی پست الکترونیکی دیگران پیگرد قانونی دارد و آگهی دهنده مسئول آن تلقی شده و Kiusk.ca در این مورد هیچ گونه مسئولیتی     ندارد.

                اکانت شما

                جهت استفاده از وب سایت Kiusk.ca)Kiusk group ltd) شما ممکن است نیاز به  داشتن اکانت و ثبت نام با ایمیل ادرس و رمز عبور باشید ،ایمیل ادرس ارایه شده ایمیل ادرس شماست و شما شخصا مسعولیت حفظ و نگهداری رمز عبور شخصی و تمامی فعالیت های اکانت خود را دارید،در نتیجه شما باید از رمز عبور (گذرواژه)  خود نهایت مراقبت را انجام دهید و گذرواژه ایی انتخاب نمایید که قابل حدس زدن نباشد.

                شما ممکن است به یک سرویس،توسط سرویسشخص ثالث ( third-party) وصل شوید که به ما اجازه دسترسی ذخیره ،و یا استفاده از ان سرویس ، توسط مجوزی که شما به ان سرویس داده است.

                اگر شما فکر میکنید اکانت شما مورد خطر قرار گرفته و یا استفاده نابجا  شده از طریق ایمیل info@Kiusk.ca با ما مکاتبه کنید.'
            );
        });
    }
}
