<?php

return [
    'unknown_error_message' => 'متاسفانه مشکلی رخ داده است.' . PHP_EOL .'لطفا با پشتیبانی تماس بگیرید.',
    'login_message' => 'ارسال آگهی تنها برای اعضای سایت امکان پذیر می‌باشد. <br> چنانچه هم‌ اکنون عضو سایت هستید وارد شوید و در غیر این صورت در سایت ثبت نام کنید ',
    'login_success' => 'با موفقیت وارد شدید.',
    'login_error' => 'کاربری با این مشخصات وجود ندارد.',
    'register_message' => 'اطلاعات شخصی شما برای پردازش سفارش شما استفاده می‌شود، و پشتیبانی از تجربه شما در این وب سایت، و
    برای اهداف دیگری که در سیاست حفظ حریم خصوصی توضیح داده شده است.',
    'comment_title' => "اولین کسی باشید که برای “:title” دیدگاهی می نویسد",
    'comment_username' => 'با عنوان :username وارد شده‌اید.',
    'comment_login_message' => 'برای ارسال دیدگاه ابتدا <b><a href=":url">وارد</a></b> شوید.',
    'rate_login_message' => 'برای ثبت امتیاز ابتدا <b><a href=":url">وارد</a></b> شوید.',
    'comment_limit_error' => 'شما امروز نظر داده اید. لطفا فردا دوباره امتحان کنید.',
    'commet_complete_profile_error' => 'لطفا قبل از ادامه، پروفایل خود را تکمیل کنید.',
    'register_success' => 'با موفقیت ثبت نام شدید.',
    'register_success_with_referral' => 'با موفقیت ثبت نام شدید. با کد ":code" موفق به کسب :point امتیاز شدید.',
    'service_usage_success' => 'در خواست شما ارسال شد. مدیران ما آن را بررسی کرده و در اسرع وقت نتیجه را برای شما ارسال خواهند کرد.',
    'google_review_success' => 'نظر شما ارسال شد. مدیران ما آن را بررسی کرده و در اسرع وقت نتیجه را برای شما ارسال خواهند کرد.',
    'upload_video_success' => 'ویدئو شما ارسال شد. مدیران ما آن را بررسی کرده و در اسرع وقت نتیجه را برای شما ارسال خواهند کرد.',
    'self_chat_restriction' => 'شما نمی توانید به آگهی خود پیام ارسال کنید',
    'forgot_password_text' => 'در صورتی که رمز عبور خود را فراموش کرده اید رمز زیر را برای بازیابی رمز عبورتان وارد نمایید.',
    'forgot_password_sms' => '
    جهت تغییر پسورد حساب کیوسک کد زیر را وارد نمایید:
        :token
    ',
    'forgot_password_error' => 'شماره تلفن یا ایمیل وارد شده پیدا نشد.',
    'logout' => 'با موفقیت خارج شدید.',
    'something_went_wrong' => 'مشکلی پیش آمد. لطفا دوباره تلاش کنید.',
    'confirmed' => 'تایید شده',
    'not_confirmed' => 'تایید نشده',
    'accept_rules' => '<a href="/site-rules">شرایط و مقررات</a> پلتفرم کیوسک را به دقت مطالعه کرده و قوانین را می پذیرم.',
    'weeks' => '{1} :weeks هفته|[2, *] :weeks هفته',

    'errors' => [
        500 => 'متأسفیم، اما مشکلی پیش آمد و در حال حاضر نمی‌توانیم درخواست شما را پردازش کنیم. لطفاً بعداً دوباره امتحان کنید یا اگر مشکل ادامه داشت با ما تماس بگیرید.',
    ],

    'plans' => [
        'show_in_sidebar' => 'نمایش آگهی در سایدبار آگهی ها',
        'show_in_suggestion' => 'نمایش آگهی در آگهی های پیشنهادی',
        'show_in_main_page' => 'نمایش آگهی بصورت ویژه در صفحه اصلی',
        'vip_show_in_main_page' => 'نمایش :count آگهی بصورت ویژه در صفحه اصلی',
        'pin_ad' => 'نمایش و پین آگهی در کانال کیوسک',
        'pin_ad_instagram' => 'تبلیغ خود را در صفحه اینستاگرام کیوسک پین کنید.',
        'pin_ad_instagram_highlight' => 'تبلیغ خود را در هایلایت های اینستاگرام کیوسک نمایش دهید',
        'motion_story' => 'ساخت استوری موشن گرافیک برای این آگهی',
        'story' => 'نمایش آگهی در استوری اینستاگرام، بصورت روزانه',
        'narration' => 'ساخت استوری موشن گرافیک با <span class="badge bg-danger">نریشن</span> برای این آگهی',
        'free_blog_ad' => 'تبلیغ رایگان در پیشخوان سایت',
        'telegram_group_ad' => 'تبلیغ در گروه های تلگرامی',
        'telegram_channel' => 'نمایش آگهی در کانال کیوسک، بصورت روزانه',
        'telegram_bot' => 'نمایش آگهی در ربات کیوسک، در شروع ربات',
        'intervals' => [
            'day' => '{1} روزانه|[2,*] :count روز',
            'month' => '{1} ماهانه|[2,*] :count ماه',
            'year' => '{1} سالانه|[2,*] :count سال',
        ]
    ],

    'report' => [
        // 'intro' => 'ما می‌خواستیم به‌روزرسانی‌هایی در مورد عملکرد تبلیغات، پیوندهای اجتماعی، و امتیازات و همچنین پیام‌های خوانده نشده‌ای که ممکن است داشته باشید به شما ارائه دهیم. خلاصه ای از گزارش های هفتگی و ماهانه:',
        'daily_intro' => 'گزارش روزانه:',
        'daily_content' => '
            - کل بازدید از تبلیغات شما: :adViews
            - مجموع نظرات در مورد تبلیغات شما: :adComments

            از اینکه از سرویس ما استفاده کردید متشکریم!
        ',
        'visit' => 'لینک وبسایت',
        'read_message' => 'مشاهده پیام',
        'intro' => 'خلاصه ای از گزارش های هفتگی و ماهانه:',
        'report_body' => '
            1. تعداد کلیک های وب سایت و رسانه های اجتماعی
                - هفتگی: :linkClicksWeeklyCount
                - ماهانه: :linkClicksMonthlyCount
            2. نظرات به آگهی شما
                - هفتگی: :reviewsVisibleWeeklyCount
                - ماهانه: :reviewsVisibleMonthlyCount
            3. استفاده از خدمات آگهی شما
                - هفتگی: :serviceUsagesConfirmedWeeklyCount
                - ماهانه: :serviceUsagesConfirmedMonthlyCount
            4. پیام ها
                - هفتگی: :messagesWeeklyCount
                - ماهانه: :messagesMonthlyCount
            5. امتیازات (کسب شده)
                - هفتگی: :claimedScoresWeeklySum
                - ماهانه: :claimedScoresMonthlySum
            6. امتیازات (در انتظار کسب)
                - هفتگی: :unclaimedScoresWeeklySum
                - ماهانه: :unclaimedScoresMonthlySum
            7. امتیازات (استفاده شده)
                - هفتگی: :spentScoresWeeklySum
                - ماهانه: :spentScoresMonthlySum
        ',
    ],

    'ads' => [
        'delete' => 'آیا مایل به حذف آگهی خود هستید؟',
        'created_ad_notification' => 'آگهی شما با موفقیت ایجاد شد. مدیران ما در اسرع وقت آن را بررسی و تایید خواهند کرد. پس از تایید آگهی شما، برای سایر کاربران قابل مشاهده خواهد بود. از اینکه از سرویس ما استفاده کردید متشکریم!',
        'approved' => 'آگهی شما تایید شده و برای کاربران قابل مشاهده خواهد بود. برای بهتر دیده شدن، آگهی خود را ارتقا دهید.',
        'title' => 'با ارتقا به سطح کاربری <a href="/my-account/upgrade">VIP</a> علاوه بر ثبت آگهی در تمامی شاخه ها میتوانید تا سه آگهی را بصورت ویژه منتشر کنید.',
        // 'title' => 'با ارتقا به سطح کاربری <a href="/my-account/upgrade">VIP</a> یا <a href="/my-account/upgrade">VIP Business</a> قادر خواهید بود سه یا چند اگهی خود را با شرایط ویژه ارتقا دهید.',
        'promote_confirm_title' => 'آیا مطمئنید میخواهید این آگهی را ارتقا دهید؟',
        'promote_confirm_text' => 'بعد از تایید شما قادر به تغییر آن نخواهید بود.',
        'promote_success' => 'آگهی شما با موفقیت ارتقا یافت.',
        'promote_limit_error' => 'شما به حد مجاز طرح خود رسیده اید. اگر می خواهید تبلیغات خود را تبلیغ کنید، خرید یا طرح خود را ارتقا دهید.'
    ],

    'categories' => [
        'types' => [
            'all' => 'همه',
            'customer' => 'مشترک عادی',
            'business_owner' => 'شغل',
            'real_estate' => 'املاک',
            'seller' => 'فروش کالا',
            'property_applicant' => 'متقاضی ملک',
            'vip' => 'VIP',
        ],
    ],

    'scores' => [
        'description' => 'بعنوان کاربر کیوسک می توانید از طریق فعالیت هایی مانند تکمیل پروفایل کاربری، ارائه نظر در آگهی های تبلیغاتی یا وبلاگ ها، ثبت نام با کدهای ارجاع، ارسال نظرات گوگل، ارسال ویدیوها و درج فیدبک استفاده از خدمات امتیاز کسب کنید. این امتیازات نه تنها نشان دهنده تعامل فعال شما با پلتفرم کیوسک است، بلکه این امکان فراهم می شود تا با استفاده از امتیازات، از تخفیف ها و جوایز ارزشمندی برخوردار شوید.',
        'usage_description' => 'هنگامی که امتیازات کسب شده به مقدار مشخصی می رسد، بعنوان کاربر کیوسک می توانید از امتیازات کسب شده برای دریافت کوپن استفاده کنید. برای دریافت کوپن ها، ابتدا باید طرح تخفیفی متناسب با امتیازات را انتخاب کنید.
        طرح تخفیفی تعیین می کند که چه تعداد کوپن و یا چه مقدار تخفیف می توانید دریافت کنید.
        سیستم استفاده از امتیازات کیوسک بمنظور تقدیر از وفاداری و تشویق شما برای ادامه استفاده از خدمات طراحی شده است.',
        'types' => [
            'comment' => 'کامنت مقالات',
            'review' => 'کامنت آگهی ها',
            'rate' => 'امتیاز به آگهی ها',
            'referral' => 'ثبت نام با کد ارجاع',
            'complete_registration' => 'تکمیل پروفایل',
            'google_review' => 'نظرات گوگل',
            'send_video' => 'آپلود ویدئو',
            'service_usage' => 'استفاده از خدمات',
        ],
        'emails' => [
            'title' => 'تبریک!',
            'subtitle' => ':name گرامی,',
            'body' => 'تبریک می گوییم، شما :score امتیاز بابت :type در کیوسک بدست آورده اید.',
            'regards' => 'با احترام،',
            'kiusk_team' => 'تیم کیوسک',
        ],
        'limit_error' => 'طرحی که انتخاب کردید بیشتر از امتیازات کسب شده شما نیاز دارد.',
        'unclaimed_scores_description' => 'امتیازات در انتظار، امتیازاتی هستند که ملزم به تایید مدیران سایت می باشند. این امتیازات پس از تایید از سمت مدیران سایت، به بخش امتیازات مرتبط اضافه می گردد.',
    ],

    // Flash messages
    'destroy' => ':name با موفقیت حذف شد.',
    'create' => ':name با موفقیت ثبت شد.',
    'edit' => ':name با موفقیت ویرایش شد.',

    'profile' => [
        'edit' => 'پروفایل شما با موفقیت ویرایش شد.',
        'upgraded_role' => 'نقش با موفقیت ارتقا یافت.',
        'upgrade_role_description' => 'با ارتقا سطح دسترسی خود به VIP، امکان ایجاد تبلیغات در انواع دسته آگهی ها را خواهید داشت. علاوه بر این، می توانید در زمینه خاص خود نیز آگهی درج کنید. لطفاً توجه داشته باشید که ارتقا سطح دسترسی شما ممکن است با هزینه های اضافی همراه باشد. اگر سوال یا ابهامی دارید، لطفا با ما تماس بگیرید.',
        'avatar_message' => 'عکس پروفایل ویرایش شد.',
        'avatar_delete_message' => 'عکس پروفایل حذف شد.',
        'upgrade_error' => 'شما تنها میتوانید به نقش VIP ارتقا دهید.',
    ],

    'statuses' => [
        'pending' => 'در حال بررسی',
        'replied' => 'پاسخ داده شده',
        'draft' => 'پیش نویس',
        'published' => 'منتشر شده',
        'pending_payment' => 'در انتظار پرداخت',
        'payment_completed' => 'پرداخت شده',
        'canceled' => 'لغو شده',
        'expired' => 'منقضی شده',
        'reported' => 'گزارش شده',
    ],

    'payments' => [
        'statuses' => [
            'COMPLETED' => 'تکمیل شده',
            'CREATED' => 'ایجاد شده',
            'CANCELED' => 'لغو شده'
        ],
    ],

    'warnings' => [
        'edit_profile_title' => 'کاربر گرامی فیلد های زیر را پر نمایید تا بتوانید از فعالیت های امتیاز آور وبسایت کیوسک بهره مند شوید:',
        'first_name' => 'نام خالی می باشد',
        'last_name' => 'نام خانوادگی خالی می باشد',
        'name' => 'نام نمایشی خالی می باشد',
        'phone' => 'شماره تلفن خالی می باشد',
        'email' => 'ایمیل خالی می باشد',
        'password' => 'رمز عبور خالی می باشد',
        'email_verified_at' => 'ایمیل شما تایید نشده است',
        'phone_verified_at' => 'شماره تلفن شما تایید نشده است',
        'address' => 'آدرس خالی می باشد',
        'avatar' => 'عکس آواتار تنظیم نشده است',
    ],

    'video' => 'فایل ویدئو با موفقیت ثبت شد',

    'referral' => [
        'description' => 'کد ارجاع شما یک کد منحصر به فرد است که می توانید با دوستان و خانواده خود به اشتراک بگذارید. وقتی شخصی از کد ارجاع شما برای ثبت نام در سرویس ما استفاده می کند، شما موفق به کسب امتیاز می شوید که می توانید از آن برای تخفیف استفاده کنید.',
    ],

    'publish_ad_message' => 'آگهی شما با موفقیت ثبت شده و پس از بررسی و تأیید مدیریت در سایت منتشر خواهد شد.',

    'created_ad_pending' => 'آگهی با موفقیت ایجاد شد.پس از تایید منتشر خواهد شد.',
    'create_ad_pending_payment' => 'آگهی با موفقیت ایجاد شد. آگهی پس از خرید یا ارتقا بسته، تایید و منتشر خواهد شد.',
    'payment_email' => 'با تشکر از خرید شما. یک اشتراک :duration روز برای شما به قیمت :price$ با شماره ارجاع :reference_number ایجاد شد',
    "verify_code_sms" => "کد تایید شما :code",
    "mobile_verification_error" => "شماره موبایل شما تایید نشده است.",
    'email_verification_notification' => 'جهت تایید آدرس ایمیل خود کد زیر را وارد نمایید : :code',
    'email_notification_introduction' => 'سلام :name عزیز',
    'email_verified' => 'ایمیل شما با موفقیت تأیید شد.',
    'phone_verified' => 'شماره تلفن شما با موفقیت تأیید شد.',
    'phone_verification_message' => 'سلام! از اینکه برای خدمات ما ثبت نام کردید متشکریم. کد تأیید شما :code است. لطفاً این کد را در وب سایت ما وارد کنید تا شماره تلفن خود را تأیید کنید. اگر برای خدمات ما ثبت نام نکرده اید، لطفاً این پیام را نادیده بگیرید. https://kiusk.ca',
    'email_not_verified' => 'با عرض پوزش، ایمیل شما تأیید نشد. کد وارد شده مطابقت ندارد.',
    'phone_not_verified' => 'با عرض پوزش، شماره تلفن شما تأیید نشد. کد وارد شده مطابقت ندارد',
    'verify_phone_subheading' => 'کد تأییدی را که به شماره تلفن شما فرستادیم وارد کنید.',
    'verify_email_error' => 'با عرض پوزش، قبل از ایجاد هر تبلیغی باید ایمیل خود را تأیید کنید.',
    // 'cart_description' => 'نمایش آگهی شما در :show_in_main_page :show_in_suggestion :show_in_sidebar .',
    // 'cart_description_pin' => 'تبلیغ شما در کانال تلگرام، صفحه اینستاگرام پین می شود و در هایلایت اینستاگرام نمایش داده می شود.',
    'ad_page_title' => 'کاربر گرامی به منظور ثبت آگهی تبلیغاتی در سایت کیوسک، یکی از گزینه های زیر را انتخاب کنید.',
    'signup-phone' => 'جهت ورود به فرایند ثبت تبلیغات، شماره تلفن همراه خود را وارد نمایید و بر روی دکمه ادامه کلیک کنید. کد تایید برای شما ارسال خواهد شد.',
    'sent_code' => "ما برای تأیید شماره تلفن شما پیامکی ارسال کردیم، لطفا کد را در قسمت زیر وارد کنید.",
    'messages' => 'پیام ها',
    'unread_messages_count' => 'شما :count پیام خوانده نشده دارید.',
    'permissions' => [
        'create_ad_denied' => 'با عرض پوزش، به نظر می رسد شما برای ایجاد آگهی دسترسی ندارید. لطفاً سطح دسترسی خود را ارتقا دهید یا برای اطلاعات بیشتر با سرپرست تماس بگیرید.',
    ],
    'area_unit' => [
        'square_meter' => 'متر مربع',
        'square_feet' => 'فوت مربع',
    ],
    'area_unit_short' => [
        'square_meter' => 'Sq m',
        'square_feet' => 'Sq ft'
    ],
    'facilities' => [
        'facility' => 'تسهیلات',
        'nearby_facility' => 'تسهیلات اطراف',
        'building_facility' => 'تسهیلات ساختمان',
        'unit_facility' => 'تسهیلات واحد',
        'parking' => 'پارکینگ',
    ],
    'roles' => [
        'admin' => 'ادمین',
        'super_admin' => 'سوپر ادمین',
        'customer' => 'مشترک',
        'subscriber' => 'مشترک',
        'seo' => 'مدیر سئو',
        'author' => 'نویسنده',
        'business_owner' => 'مالک بیزنس',
        'seller' => 'فروشنده کالا',
        'real_estate' => 'مشاور املاک',
        'vip' => 'مشترک ویژه (VIP)',
        'property_applicant' => 'متقاضی ملک',
    ],

    //Telegram
    'telegram_bot_description' => 'پس از ثبت نام در ربات تلگرام  ورود با شماره موبایل ثبت شده در سایت کیوسک امکان پذیر است.',
    'telegram' => [
        'success' => [
            'normal_user' => 'تبریک می گویم! شما با موفقیت به نقش کاربر دسترسی پیدا کردید. اکنون می توانید تبلیغات موجود در پلتفرم ما را بررسی کنید. ما امیدواریم که شما پیشنهادات کاملی را پیدا کنید که نیازهای شما را برآورده کند. از تجربه مرور خود لذت ببرید!',
            'real_estate' => 'تبریک می گویم! به شما نقش املاک و مستغلات اعطا شده است. اکنون می توانید در دسته املاک و مستغلات تبلیغات ایجاد کنید. املاک و لیست های اجاره ای خود را به خریداران و مستاجران بالقوه به نمایش بگذارید. از همین امروز شروع به جذب افراد علاقه مند کنید!',
            'property_applicant' => 'تبریک می گویم! به شما نقش متقاضی ملک اعطا شده است. اکنون می توانید در دسته املاک و مستغلات آگهی تقاضا ایجاد کنید. اگر به دنبال ملک با مشخصات شخصی مورد نظر خود هستید می توانید از این طریق ملک مورد نظر خود را پیدا کنید.!',
            'seller' => 'تبریک می گویم! به شما نقش فروشنده داده شده است. اکنون می توانید در دسته بندی کالاهای فروش تبلیغات ایجاد کنید. محصولات خود را به کاربران پلتفرم ما تبلیغ و بفروشید. ما برای شما آرزوی موفقیت بزرگ در تلاش های فروش خود را داریم!',
            'business_owner' => 'تبریک می گویم! شما با موفقیت نقش مالک کسب و کار را به دست آوردید. اکنون می توانید برای نمایش خدمات، تبلیغات و رویدادهای خود تبلیغاتی در دسته کسب و کار ایجاد کنید. با پلتفرم ما به مخاطبان بیشتری برسید و کسب و کار خود را تقویت کنید!',
            'vip' => 'تبریک می گویم! شما به وضعیت VIP دست یافته اید. به عنوان یک عضو VIP، شما توانایی ایجاد تبلیغات در هر دسته‌ای را دارید و حداکثر در معرض دید قرار می‌گیرید. علاوه بر این، می توانید تبلیغات خود را در کانال تلگرام و صفحه اینستاگرام ما پین کنید و همچنین تبلیغات خود را برجسته کنید. از این ویژگی های انحصاری برای افزایش دامنه و تأثیر تبلیغات خود استفاده کنید.',
        ],
        'vip_plan_purchase' => 'برای اشتراک عضویت VIP، خرید طرح VIP الزامی است. متشکرم.',
        'upgrade_level_text' => '
<b>خوش آمدید! لطفاً نقش کاربری را انتخاب کنید که با نیازهای شما مطابقت دارد:</b>

<b>کاربر عادی:</b> به عنوان یک کاربر، می توانید تبلیغات را بررسی کنید اما توانایی ایجاد تبلیغات را ندارید. شما می توانید تبلیغات مختلف موجود در پلت فرم ما را بررسی کنید و بازخورد ارزشمندی را ارائه دهید.

<b>املاک و مستغلات: </b>اگر حرفه ای در زمینه املاک و مستغلات هستید، این نقش به شما اجازه می دهد تا تبلیغات ویژه ای در دسته املاک ایجاد کنید. می‌توانید املاک، لیست‌های اجاره‌ای و سایر پیشنهادات مرتبط با املاک را به نمایش بگذارید.

<b>فروشنده:</b> به عنوان یک فروشنده، شما این امتیاز را دارید که تبلیغات منحصراً در دسته کالاهای فروش ایجاد کنید. این نقش شما را قادر می سازد تا محصولات مختلف را به کاربران پلتفرم خود تبلیغ و بفروشید.

<b>صاحب کسب و کار:</b> اگر صاحب یک کسب و کار هستید و می خواهید خدمات خود را تبلیغ کنید، این نقش برای شما ایده آل است. شما می توانید تبلیغاتی را به طور خاص در دسته کسب و کار ایجاد کنید و پیشنهادات، تبلیغات و رویدادهای شرکت خود را به نمایش بگذارید.

<b>VIP:</b> نقش VIP امتیازات گسترده ای را در اختیار شما قرار می دهد. شما توانایی ایجاد تبلیغات در هر دسته ای را دارید. علاوه بر این، به عنوان یک عضو VIP، می توانید تبلیغات خود را در کانال تلگرام و صفحه اینستاگرام ما پین کنید و دید و بازدید بیشتری را به دست آورید.
        ',
        'adsCreatePreview' => '
<b>🟢اطلاعات آگهی🟢:</b>

<b>دسته بندی</b>: <i> :category </i>
<b>عنوان فارسی</b>: <i>:title </i>
<b>عنوان انگلیسی</b>: <i>:title_en </i>
<b>محتوا فارسی</b>: <i>:content </i>
<b>محتوا انگلیسی</b>: <i>:content_en </i>
<b>استان</b>: <i>:state </i>
<b>شهر</b>: <i>:city </i>
<b>عکس</b>: <i>:image </i>
        ',
        'adsRealEstateSaleCreatePreview' => '
<b>🟢اطلاعات آگهی🟢:</b>

<b>دسته بندی</b>: <i> :category </i>
<b>عنوان فارسی</b>: <i>:title </i>
<b>عنوان انگلیسی</b>: <i>:title_en </i>
<b>محتوا فارسی</b>: <i>:content </i>
<b>محتوا انگلیسی</b>: <i>:content_en </i>
<b>استان</b>: <i>:state </i>
<b>شهر</b>: <i>:city </i>
<b>عکس</b>: <i>:image </i>
<b>قیمت فروش</b>: <i>:sale_price</i>
<b>مالیات سالانه</b>: <i>:yearly_tax</i>
<b>نگه داشتن قیمت</b>: <i>:price_keep</i>
<b>متراژ</b>: <i>:area :areaUnit</i>
<b>طبقه</b>: <i>:floor</i>
<b>اتاق ها</b>: <i>:rooms</i>
<b>حمام ها</b>: <i>:bathrooms</i>
<b>سال ساخت</b>: <i>:construction_year</i>
<b>تاریخ در دسترس بودن</b>: <i>:availability_date</i>
<b>پارکینگ</b>: <i>:parking</i>
<b>امکانات عمومی</b>: <i>:facilities</i>
<b>امکانات اطراف</b>: <i>:nearby_facilities</i>
<b>امکانات ساختمان</b>: <i>:building_facilities</i>
<b>امکانات واحد</b>: <i>:unit_facilities</i>
        ',
        'adsRealEstateRentCreatePreview' => '
<b>🟢اطلاعات آگهی🟢:</b>

<b>دسته بندی</b>: <i> :category </i>
<b>عنوان فارسی</b>: <i>:title </i>
<b>عنوان انگلیسی</b>: <i>:title_en </i>
<b>محتوا فارسی</b>: <i>:content </i>
<b>محتوا انگلیسی</b>: <i>:content_en </i>
<b>استان</b>: <i>:state </i>
<b>شهر</b>: <i>:city </i>
<b>عکس</b>: <i>:image </i>
<b>قیمت رهن</b>: <i>:mortgage_price</i>
<b>قیمت اجاره</b>: <i>:rent_price</i>
<b>متراژ</b>: <i>:area :areaUnit</i>
<b>طبقه</b>: <i>:floor</i>
<b>اتاق ها</b>: <i>:rooms</i>
<b>حمام ها</b>: <i>:bathrooms</i>
<b>سال ساخت</b>: <i>:construction_year</i>
<b>تاریخ در دسترس بودن</b>: <i>:availability_date</i>
<b>پارکینگ</b>: <i>:parking</i>
<b>امکانات عمومی</b>: <i>:facilities</i>
<b>امکانات اطراف</b>: <i>:nearby_facilities</i>
<b>امکانات ساختمان</b>: <i>:building_facilities</i>
<b>امکانات واحد</b>: <i>:unit_facilities</i>
        ',
        'createAdSmsText' => 'از ارسال آگهی خود با عنوان ":title" سپاسگزاریم. تیم ما آگهی شما را بررسی می کند و به زودی آن را تأیید می کند. پس از تایید، تبلیغ شما در سایت ما نمایش داده می شود. می توانید تبلیغ خود را برای دیده شدن بهتر ارتقا دهید و به مشتریان بالقوه بیشتری دسترسی پیدا کنید.
        :link
        ',
        'editAdSmsText' => 'آگهی شما با عنوان ":title" با موفقیت ویرایش شد. تیم ما آگهی شما را بررسی می کند و به زودی آن را تأیید می کند. پس از تایید، تبلیغ شما در سایت ما نمایش داده می شود. می توانید تبلیغ خود را برای دیده شدن بهتر ارتقا دهید و به مشتریان بالقوه بیشتری دسترسی پیدا کنید.
        :link
        ',
        'user_score_text' => '
<b>امتیازات شما:</b>

<b>مجموع امتیازات</b>: <i>:total_score</i>t
<b>مجموع امتیازات استفاده شده</b>: <i>:total_used_score</i>
<b>مجموع امتیازات در انتظار</b>: <i>:total_pending_score</i>

<b>تکمیل پروفایل</b>: <i>:complete_profile %</i>
<b>نظرات آگهی/مقالات</b>: <i>:blog_ad_review</i>
<b>امتیاز به آگهی ها</b>: <i>:ad_rating</i>
<b>ارسال نظر گوگل</b>: <i>:google_review</i>
<b>بارگذاری ویدئو</b>: <i>:upload_video</i>
<b>استفاده از خدمات</b>: <i>:use_services</i>
<b>ثبت نام با ارجاع</b>: <i>:referral_user</i>
        ',
        'generated_code_title' => "<b>کد های تولید شده</b>",
    ],

    'welcome' => '
<p>سلام،</p>
<p>از اینکه وب سایت ما را انتخاب کردید متشکریم.</p>
<p>در کیوسک، ما متعهد هستیم که بهترین تجربه ممکن را به کاربران خود ارائه دهیم.</p>
<p>برای استفاده بهتر از خدمات کیوسک، لطفاً چند لحظه وقت بگذارید و <a href="https://kiusk.ca/site-rules">قوانین سایت</a> را مرور کنید. همچنین چنانچه سوال یا ابهامی دارید، لطفا با ما تماس بگیرید. تیم پشتیبانی ما بصورت 24 ساعته آماده پاسخگویی به کاربران است.</p>
<p>مجددا از اینکه کیوسک را انتخاب کردید سپاسگزاریم. ما مشتاقانه منتظر همکاری با شما هستیم!</p>

با احترام، تیم کیوسک<br>
    ',

    'order_transaction_success' => '
    آگهی شما با موفقیت پرداخت شد

 شناسه آگهی : :orderId

 شناسه تراکنش: :transactionId

 مبلغ پرداختی: $:price
    ',
    'order_transaction_failed' => '
    پرداخت شما با موفقیت انجام نشد.

 شناسه آگهی : :orderId

 شناسه تراکنش: :transactionId

 مبلغ پرداختی: $:price
    ',

    'advertisements' => [
        'select_category' => 'در چه دسته بندی می خواهید آگهی شما نمایش داده شود؟',
        'send_image' => 'لطفا تصویر آگهی خود را ارسال نمایید.',
        'send_image_en' => 'لطفا تصویر انگلیسی آگهی خود را ارسال نمایید.',
        'create_content' => 'لطفا توضیحات آگهی خود را ارسال نمایید.',
        'create_content_en' => 'لطفا توضیحات آگهی خود به انگلیسی را ارسال نمایید.',
        'create_link' => 'لطفا لینک آگهی خود را ارسال کنید.',
        'create_success' => 'آگهی شما با موفق ایجاد شد. پس از پرداخت و تایید منتشر خواهد شد.',
        'edit_description' => 'لطفا توضیحات آگهی خود را ارسال نمایید.',
        'edit_description_en' => 'لطفا توضیحات آگهی خود را به انگلیسی ارسال نمایید.',
        'edit_gallery_text' => 'لطفا تصویر فارسی آگهی خود را ارسال نمایید.',
        'edit_gallery_en_text' => 'لطفا تصویر انگلیسی آگهی خود را ارسال نمایید.',
        'edit_link' => 'لطفا لینک آگهی خود را ارسال کنید.',
        'payment' => "از طریق لینک زیر جهت تایید و نمایش تبلیغ اقدام به پرداخت نمایید",
        'not_found' => 'تبلیغ پیدا نشد.',
        'confirm_edit' => 'ارسال برای تایید و نمایش',
        'delete' => 'حذف کردن(غیر قابل بازگشت)',
        'delete_message' => 'از حذف آگهی مطمئن هستید ؟(قابلیت بازگشت وجود ندارد.)',
        'help' => 'سلام
        برای ایجاد تبلیغ بر روی گزینه‌ی ساخت تبلیغ کلیک کنید
        سپس بعد از وارد نمودن اطلاعات خود می توانید از خدمات تبلیغات گسترده در کانادا استفاده کنید😍'
    ],
];
